nxp-mcuxpresso/mcux-devices-mcx/MCXE/MCXE317/startup_mcxe317.cpp
WEAK void Reserved142_IRQHandler(void)
{
    Reserved142_DriverIRQHandler();
}

WEAK void Reserved143_IRQHandler(void)
{
    Reserved143_DriverIRQHandler();
}

WEAK void Reserved144_IRQHandler(void)
{
    Reserved144_DriverIRQHandler();
}

WEAK void Reserved145_IRQHandler(void)
{
    Reserved145_DriverIRQHandler();
}

WEAK void Reserved146_IRQHandler(void)
{
    Reserved146_DriverIRQHandler();
}

WEAK void Reserved147_IRQHandler(void)
{
    Reserved147_DriverIRQHandler();
}

WEAK void Reserved148_IRQHandler(void)
{
    Reserved148_DriverIRQHandler();
}

WEAK void Reserved149_IRQHandler(void)
{
    Reserved149_DriverIRQHandler();
}

WEAK void Reserved150_IRQHandler(void)
{
    Reserved150_DriverIRQHandler();
}

WEAK void Reserved151_IRQHandler(void)
{
    Reserved151_DriverIRQHandler();
}

WEAK void Reserved152_IRQHandler(void)
{
    Reserved152_DriverIRQHandler();
}

WEAK void Reserved153_IRQHandler(void)
{
    Reserved153_DriverIRQHandler();
}

WEAK void Reserved154_IRQHandler(void)
{
    Reserved154_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{
    FLEXIO_DriverIRQHandler();
}

WEAK void Reserved156_IRQHandler(void)
{
    Reserved156_DriverIRQHandler();
}

WEAK void LPUART_0_IRQHandler(void)
{
    LPUART_DriverIRQHandler(0U);
}

WEAK void LPUART_1_IRQHandler(void)
{
    LPUART_DriverIRQHandler(1U);
}

WEAK void LPUART_2_IRQHandler(void)
{
    LPUART_DriverIRQHandler(2U);
}

WEAK void LPUART_3_IRQHandler(void)
{
    LPUART_DriverIRQHandler(3U);
}

WEAK void LPUART_4_IRQHandler(void)
{
    LPUART_DriverIRQHandler(4U);
}

WEAK void LPUART_5_IRQHandler(void)
{
    LPUART_DriverIRQHandler(5U);
}

WEAK void LPUART_6_IRQHandler(void)
{
    LPUART_DriverIRQHandler(6U);
}

WEAK void LPUART_7_IRQHandler(void)
{
    LPUART_DriverIRQHandler(7U);
}

WEAK void Reserved165_IRQHandler(void)
{
    Reserved165_DriverIRQHandler();
}

WEAK void Reserved166_IRQHandler(void)
{
    Reserved166_DriverIRQHandler();
}

WEAK void Reserved167_IRQHandler(void)
{
    Reserved167_DriverIRQHandler();
}

WEAK void Reserved168_IRQHandler(void)
{
    Reserved168_DriverIRQHandler();
}

WEAK void Reserved169_IRQHandler(void)
{
    Reserved169_DriverIRQHandler();
}

WEAK void Reserved170_IRQHandler(void)
{
    Reserved170_DriverIRQHandler();
}

WEAK void Reserved171_IRQHandler(void)
{
    Reserved171_DriverIRQHandler();
}

WEAK void Reserved172_IRQHandler(void)
{
    Reserved172_DriverIRQHandler();
}

WEAK void Reserved173_IRQHandler(void)
{
    Reserved173_DriverIRQHandler();
}

WEAK void Reserved174_IRQHandler(void)
{
    Reserved174_DriverIRQHandler();
}

WEAK void Reserved175_IRQHandler(void)
{
    Reserved175_DriverIRQHandler();
}

WEAK void Reserved176_IRQHandler(void)
{
    Reserved176_DriverIRQHandler();
}

WEAK void LPI2C0_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(0U);
}

WEAK void LPI2C1_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(1U);
}

WEAK void Reserved179_IRQHandler(void)
{
    Reserved179_DriverIRQHandler();
}

WEAK void Reserved180_IRQHandler(void)
{
    Reserved180_DriverIRQHandler();
}

WEAK void LPSPI0_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(0U);
}

WEAK void LPSPI1_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(1U);
}

WEAK void LPSPI2_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(2U);
}

WEAK void LPSPI3_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(3U);
}

WEAK void Reserved185_IRQHandler(void)
{
    Reserved185_DriverIRQHandler();
}

WEAK void Reserved186_IRQHandler(void)
{
    Reserved186_DriverIRQHandler();
}

WEAK void Reserved187_IRQHandler(void)
{
    Reserved187_DriverIRQHandler();
}

WEAK void Reserved188_IRQHandler(void)
{
    Reserved188_DriverIRQHandler();
}


WEAK void Reserved189_IRQHandler(void)
{
    Reserved189_DriverIRQHandler();
}

WEAK void Reserved190_IRQHandler(void)
{
    Reserved190_DriverIRQHandler();
}

WEAK void Reserved191_IRQHandler(void)
{
    Reserved191_DriverIRQHandler();
}

WEAK void Reserved192_IRQHandler(void)
{
    Reserved192_DriverIRQHandler();
}

WEAK void Reserved193_IRQHandler(void)
{
    Reserved193_DriverIRQHandler();
}

WEAK void JDC_IRQHandler(void)
{
    JDC_DriverIRQHandler();
}

WEAK void Reserved195_IRQHandler(void)
{
    Reserved195_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
    ADC0_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
    ADC1_DriverIRQHandler();
}

WEAK void Reserved198_IRQHandler(void)
{
    Reserved198_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{
    CMP0_DriverIRQHandler();
}

WEAK void CMP1_IRQHandler(void)
{
    CMP1_DriverIRQHandler();
}

WEAK void Reserved201_IRQHandler(void)
{
    Reserved201_DriverIRQHandler();
}

WEAK void Reserved202_IRQHandler(void)
{
    Reserved202_DriverIRQHandler();
}

WEAK void Reserved203_IRQHandler(void)
{
    Reserved203_DriverIRQHandler();
}

WEAK void Reserved204_IRQHandler(void)
{
    Reserved204_DriverIRQHandler();
}

WEAK void FCCU_0_IRQHandler(void)
{
    FCCU_0_DriverIRQHandler();
}

WEAK void FCCU_1_IRQHandler(void)
{
    FCCU_1_DriverIRQHandler();
}

WEAK void STCU_IRQHandler(void)
{
    STCU_DriverIRQHandler();
}

WEAK void MU0_B_TX_IRQHandler(void)
{
    MU0_B_TX_DriverIRQHandler();
}

WEAK void MU0_B_RX_IRQHandler(void)
{
    MU0_B_RX_DriverIRQHandler();
}

WEAK void MU0_B_IRQHandler(void)
{
    MU0_B_DriverIRQHandler();
}

WEAK void MU1_B_TX_IRQHandler(void)
{
    MU1_B_TX_DriverIRQHandler();
}

WEAK void MU1_B_RX_IRQHandler(void)
{
    MU1_B_RX_DriverIRQHandler();
}

WEAK void MU1_B_IRQHandler(void)
{
    MU1_B_DriverIRQHandler();
}

WEAK void Reserved214_IRQHandler(void)
{
    Reserved214_DriverIRQHandler();
}

WEAK void Reserved215_IRQHandler(void)
{
    Reserved215_DriverIRQHandler();
}

WEAK void Reserved216_IRQHandler(void)
{
    Reserved216_DriverIRQHandler();
}

WEAK void Reserved217_IRQHandler(void)
{
    Reserved217_DriverIRQHandler();
}

WEAK void Reserved218_IRQHandler(void)
{
    Reserved218_DriverIRQHandler();
}

WEAK void Reserved219_IRQHandler(void)
{
    Reserved219_DriverIRQHandler();
}

WEAK void Reserved220_IRQHandler(void)
{
    Reserved220_DriverIRQHandler();
}

WEAK void Reserved221_IRQHandler(void)
{
    Reserved221_DriverIRQHandler();
}

WEAK void Reserved222_IRQHandler(void)
{
    Reserved222_DriverIRQHandler();
}

WEAK void Reserved223_IRQHandler(void)
{
    Reserved223_DriverIRQHandler();
}

WEAK void Reserved224_IRQHandler(void)
{
    Reserved224_DriverIRQHandler();
}

WEAK void Reserved225_IRQHandler(void)
{
    Reserved225_DriverIRQHandler();
}

WEAK void Reserved226_IRQHandler(void)
{
    Reserved226_DriverIRQHandler();
}

WEAK void Reserved227_IRQHandler(void)
{
    Reserved227_DriverIRQHandler();
}

WEAK void PLL_LOL_IRQHandler(void)
{
    PLL_LOL_DriverIRQHandler();
}

WEAK void CORE_CLK_FAIL_IRQHandler(void)
{
    CORE_CLK_FAIL_DriverIRQHandler();
}

WEAK void Reserved230_IRQHandler(void)
{
    Reserved230_DriverIRQHandler();
}

WEAK void AIPS_PLAT_CLK_FAIL_IRQHandler(void)
{
    AIPS_PLAT_CLK_FAIL_DriverIRQHandler();
}

WEAK void Reserved232_IRQHandler(void)
{
    Reserved232_DriverIRQHandler();
}

WEAK void HSE_B_CLK_FAIL_IRQHandler(void)
{
    HSE_B_CLK_FAIL_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif
#endif // (DEBUG)
